{
  "brand": {
    "title": "Rethinking retirement",
    "logoSrc": "/favicon.ico",
    "imageSrc": "/logo.png",
    "beginText": "BEGIN",
    "beginTitle": "Let's get started!"
  },
  "slideDefaults": {
    "title": "Q{{index}}",
    "backText": "BACK",
    "nextText": "NEXT",
    "backTitle": "Go back",
    "nextTitle": "Continue",
    "cancelTitle": "Clear all answers and start again",
    "fields": [{
      "name": "message",
      "type": "textarea",
      "placeholder": "write here...",
      "required": true,
      "autofocus": true,
      "error": "Please write a response!"
    }],
    "diagram": {},
    "settings": { "omitFields": true }
  },
  "slides": [{
    "title": "Hello, visitor!",
    "subtitle": "Welcome to the Academy of Life - an experiment in rethinking retirement",
    "body": "This ethnographic research is part of a global conversation in which participants imagine how they want to spend their elderly years. The collected data is anonymous, collected on an open source platform. You can see, edit or delete it by visiting a link we will send you as confirmation. You can finish this questionnaire at any point - but the further you get, the more concrete your vision of retirement will become.",
    "fields": []
  }, {
    "title": "Ready?",
    "body": "Imagine retirement as a period when you don't need to go to work anymore. You don't need to be \"retired\", either. The division between retirement and work doesn't exist, you create the balance.",
    "fields": []
  }, {
    "index": 1,
    "body": "We don't seem to discuss retirement much with others. How much do you think about your own retirement? What do you think about? And what do you avoid thinking about?"
  }, {
    "index": 2,
    "body": "How about work, hobbies, family life, leisure, pleasure... Which activities from your present life would you like to keep doing? Which things would you like to never do again?"
  }, {
    "index": 3,
    "body": "Great, now that you've chosen what stays and what to leave behind - start to imagine your future self. The 'dream you'. How do you get there? Which new skills and what knowledge do you want to acquire?"
  }, {
    "index": 4,
    "body": "Imagine your housing situation and the people around you (or their absence). Who are you surrounded by in your retirement?<br />Where and how would you like to live?"
  }, {
    "index": 5,
    "body": "If you know people who have retired, was there something to learn from their experience and approach? Could you share their impressions?"
  }, {
    "index": 6,
    "body": "How do you imagine sustaining yourself financially? Maybe you have a plan, a tip, or an idea, that you would like to share?"
  }, {
    "index": 7,
    "title": "The last little bit!",
    "nextTitle": "Submit your response!",
    "body": "These questions will help make the research even more exact.",
    "fields": [{
      "name": "name",
      "type": "text",
      "placeholder": "Name/nickname",
      "half": true,
      "required": true,
      "autofocus": true,
      "error": "Please enter your name"
    }, {
      "name": "age",
      "type": "integer",
      "placeholder": "Age (optional)",
      "half": true
    }, {
      "name": "email",
      "type": "email",
      "placeholder": "E-mail",
      "required": true,
      "error": "Please enter your email address",
      "settings": { "omit": true }
    }, {
      "name": "consent",
      "type": "checkbox",
      "placeholder": "I understand that this form is used for research. Researchers are encouraged to treat your answers as a window into societal, economic, technological, and political trends and transformations that affect us. As I participate in the discussion, I do not fear bad consequences when sharing with others my views and alignment on societal, economic, technological and political issues",
      "required": true,
      "error": "Please consent to the terms and conditions",
      "settings": { "omit": true }
    }],
    "nextText": "SEND",
    "submit": true,
    "settings": { "omitBody": true }
  }, {
    "title": "Well done!",
    "body": "Thank you for taking the time to fill out the questionnaire! Since this project is not just a research, you can experience one of the versions of retirement by visiting the the Fužine retirement home, aka Academy of Life. The challenge team has worked there for the past months and prepared different ways for you to engage with the space and its inhabitants. You will receive the instructions on your email, or you can grab the special BIO zine that explains it. See you at the Cafe at Home!<br /><br />* you will receive the confirmation of your participation and access to delete or edit your data on your email, as well as the updates on the Academy of Life program and events. You can opt out at any time, no spam guaranteed.",
    "fields": [],
    "backText": null,
    "nextText": "MAP"
  }, {
    "title": "Map!",
    "diagram": {
      "src": "/map.png",
      "alt": "Map to the cafe"
    },
    "fields": [],
    "settings": { "invert": true },
    "backText": null,
    "nextText": null
  }],
  "errorMessages": {
    "networkError": "Sorry, we were unable to store your response due to a network connectivity issue. Please try clicking on \"Send\" again.",
    "username": "It seems somebody has already chosen your preferred username / nickname. Please enter a different one and click again on \"Send\".",
    "email": "It seems you already have an account on our forum using this e-mail address, or have entered an invalid address. Please choose a different e-mail address and click again on \"Send\".",
    "default": "Sorry, we were unable to store your response due to an unknown error. Please try clicking on \"Send\" again."
  }
}
