{
  "brand": {
    "title": "Rethinking retirement",
    "logoSrc": "/favicon.ico",
    "imageSrc": "/logo.png",
    "beginText": "ZAČNI",
    "beginTitle": "Let's get started!"
  },
  "slideDefaults": {
    "title": "Q{{index}}",
    "backText": "NAZAJ",
    "nextText": "NASLEDNJI",
    "backTitle": "Go back",
    "nextTitle": "Continue",
    "cancelTitle": "Clear all answers and start again",
    "fields": [{
      "name": "message",
      "type": "textarea",
      "placeholder": "pišite tukaj...",
      "required": true,
      "autofocus": true,
      "error": "Please write a response!"
    }],
    "settings": { "omitFields": true }
  },
  "slides": [{
    "title": "Pozdravljen, obiskovalec/ka!",
    "subtitle": "Dobrodošli v Akademiji življenja - eksperimentu, ki spodbuja razmišljanje o upokojitvi",
    "body": "Ta etnografska raziskava je del globalnega pogovora v katerem si sodelujoči predstavljajo kako bodo izgledala njihova pozna leta. Vnešeni podatki so anonimni, zbrani na odprtokodni platformi. Podatke lahko ponovno vidite, uredite ali izbrišete z obiskom povezave, ki vam jo bomo poslali kot potrditev. Vprašalnik lahko zaključite na katerikoli točki  - vendar dlje kot boste prišli, bolj jasna bo postala vaša vizija o upokojitvi.",
    "fields": []
  }, {
    "title": "Pripravljeni?",
    "body": "Predstavljajte si upokojitev kot obdobje, ko vam ni več treba v službo. In niti vam ni treba biti ‘’upokojen’’. Razloček med upokojitvijo in delom ne obstaja, vi sami lahko ustvarjate ravnotežje med njima.",
    "fields": []
  }, {
    "index": 1,
    "body": "Zdi se, da se o upokojitvi z drugimi ne pogovarjamo dosti. Kako pogosto razmišljate o lastni upokojitvi? O čem razmišljate? In o čem neradi razmišljate?"
  }, {
    "index": 2,
    "body": "Kaj pa delo, hobiji, družinsko življenje, prosti čas, sprostitev… Katere aktivnosti iz vašega sedanjega življenja želite početi še naprej? Katerih stvari si ne želite početi nikoli več?"
  }, {
    "index": 3,
    "body": "Odlično, zdaj ko ste se odločili kaj ostane in kaj boste pustili za sabo, si začnite predstavljati samega sebe v prihodnosti. Vaš ‘sanjski jaz’. Kako lahko pridete do tja? Katere nove sposobnosti in katera nova znanja želite pridobiti?"
  }, {
    "index": 4,
    "body": "Predstavljajte si vašo stanovanjsko situacijo in ljudi, ki vas obkrožajo (ali njihovo odsotnost). S kom boste obkroženi po upokojitvi? Kje in kako si želite živeti?"
  }, {
    "index": 5,
    "body": "Če poznate koga, ki se je že upokojil, ste se iz njihovih izkušenj in pristopa lahko kaj naučili? Lahko delite svoje vtise?"
  }, {
    "index": 6,
    "body": "Kako si predstavljate, da se boste finančno vzdrževali? Morda že imate načrt, nasvet, ali idejo, ki bi jo želeli deliti?"
  }, {
    "index": 7,
    "title": "In še zadnji del. Sledeča vprašanja bodo pomagala, da bo naša raziskava še bolj natančna.",
    "nextTitle": "Submit your response!",
    "body": "These questions will help make the research even more exact.",
    "fields": [{
      "name": "name",
      "type": "text",
      "placeholder": "Name/nickname",
      "half": true,
      "required": true,
      "autofocus": true,
      "error": "Please enter your name"
    }, {
      "name": "age",
      "type": "integer",
      "placeholder": "Age (optional)",
      "half": true
    }, {
      "name": "email",
      "type": "email",
      "placeholder": "E-mail",
      "required": true,
      "error": "Please enter your email address",
      "settings": { "omit": true }
    }, {
      "name": "consent",
      "type": "checkbox",
      "placeholder": "I understand that this form is used for research. Researchers are encouraged to treat your answers as a window into societal, economic, technological, and political trends and transformations that affect us. As I participate in the discussion, I do not fear bad consequences when sharing with others my views and alignment on societal, economic, technological and political issues",
      "required": true,
      "error": "Please consent to the terms and conditions",
      "settings": { "omit": true }
    }],
    "nextText": "POŠLJI",
    "submit": true,
    "settings": { "omitBody": true }
  }, {
    "title": "Dobro opravljeno!",
    "body": "Hvala, ker ste si vzeli čas in izpolnili vprašalnik! Ker ta projekt ni samo raziskava, lahko eno od različic upokojitve doživite z obiskom doma za upokojence Fužine, aka Academy of Life (Akademija življenja). Skupina za izzive je tam delala pretekle mesece in pripravila različne načine za sodelovanje s prostorom in njegovimi prebivalci. Program lahko preverite na spletni strani bio.si, ali pa v posebnem BIO zinu. Se vidimo v Cafe at Home!<br /><br />*na email račun boste prejeli potrdilo o sodelovanju in dostop za izbris in urejanje vaših podatkov, prav tako pa novice in program dogodkov, ki se odvijajo v Akademiji življenja. Odjavite se lahko kadarkoli, zagotovljeno brez neželenih sporočil.",
    "backText": null,
    "nextText": "ZEMLJEVID"
  }, {
    "title": "Zemljevid!",
    "diagram": {
      "src": "/map.png",
      "alt": "Zemljevid"
    },
    "fields": [],
    "settings": { "invert": true },
    "backText": null,
    "nextText": null
  }],
  "errorMessages": {
    "networkError": "Sorry, we were unable to store your response due to a network connectivity issue. Please try clicking on \"Send\" again.",
    "username": "It seems somebody has already chosen your preferred username / nickname. Please enter a different one and click again on \"Send\".",
    "email": "It seems you already have an account on our forum using this e-mail address, or have entered an invalid address. Please choose a different e-mail address and click again on \"Send\".",
    "default": "Sorry, we were unable to store your response due to an unknown error. Please try clicking on \"Send\" again."
  }
}
